docs/posts/2015-07-12-strength-enough.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Strength Enough?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Strength Enough?</h1>
<p class="subtitle" role="doc-subtitle">Jul 12, 2015</p>
</header><p>
Mike Bumgarner quoted part of this passage in a sermon this morning. It is worth reflecting on:
</p>

<blockquote>
<p>
This is where a tremendous decision takes place: whether we Christians have enough strength to witness before the world that we are not dreamers with our heads in the clouds&#x2026; that our faith really is not opium that keeps us content within an unjust world. Instead, and precisely because our minds are set on things above, we are that much more stubborn and purposeful in protesting here on earth&#x2026; Does it have to be that Christianity, which began as immensely revolutionary, now has to remain conservative for all time? That every new movement has to blaze its path without the church, and that the church always takes twenty years to see what has actually happened? If it really must be so, then we must not be surprised when, for our church as well, times come when the blood of martyrs will be demanded. But this blood if we truly have the courage and honour and loyalty to shed it, will not be so innocent and shining as that of the first witnesses. Our blood will be overlaid with our own great guilt.
</p>
</blockquote>

<p class="source">
Dietrich Bonhoeffer, <i>DBW</i>, Vol. 11, 446.
</p>


<div class="tagline" id="org3d189f1">
<p>
Tagged: <a href="../tags/religion.html">Religion</a> <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
